jonathan-shc/UWB/apps/esp32-matter-lock/sdkconfig.defaults.esp32c6
# ESP32-C6-DevKitC-1 target (applied after sdkconfig.defaults; later wins).
# The board ships with 8 MB flash, enough for the same enlarged OTA layout as
# C5. C6 is single-core and tops out at 160 MHz.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_8mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_8mb.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# GPIO0 is the BU04 WAKEUP line on C6. Use the DevKitC-1 BOOT button (GPIO9)
# for the local lock button; it is safe after reset but must not be held while
# booting unless download mode is intended.
CONFIG_BSP_BUTTON_1_GPIO=9
